In [1]:
import sys
import os

import pymysql as sql

## 하위 폴더에 있는 패키지 로딩을 위한 밑작업
SEP       = os.path.sep
MISC_PATH = SEP.join(os.getcwd().split(SEP)[:-2])
ROOT_PATH = SEP.join(os.getcwd().split(SEP)[:-4])
sys.path.append(MISC_PATH)

from misc.config import *
from misc.utils import *

[INFO] config.json 파일을 로딩합니다.
[INFO] ports.json 파일을 로딩합니다.

In [2]:
host   = CONFIGS.global_host
port   = PORTS.sql_port
user   = CONFIGS.sql_user
passwd = CONFIGS.sql_passwd

In [3]:
## DB 서버에 연결
conn   = sql.connect(host     = host, user = user, port = port,
                     password = passwd, db = 'study')

cursor = conn.cursor()

In [4]:
select(cursor, "whole data", table_name = 'employee_')

[query] select * from employee_;

[whole data]
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250, 1400, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500, 0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300, None, 10)

 #### **[Q #001]. 부서번호가 10번인 부서의 사람 중 사원번호, 이름, 월급을 조회하시오.**

In [5]:
select(cursor, 'A #001', table_name = 'employee_',
       column = 'empno, ename, sal', cond = 'deptno=10')

select(cursor, 'A #001 REF', table_name = 'employee_',
       column = 'empno, ename, sal, deptno', cond = 'deptno=10')

[query] select empno, ename, sal from employee_ where deptno=10;

[A #001]
(7782, 'CLARK', 2450)
(7839, 'KING', 5000)
(7934, 'MILLER', 1300)


[query] select empno, ename, sal, deptno from employee_ where deptno=10;

[A #001 REF]
(7782, 'CLARK', 2450, 10)
(7839, 'KING', 5000, 10)
(7934, 'MILLER', 1300, 10)

 #### **[Q #002]. 사원번호가 7369인 사람 중 이름, 입사일, 부서번호를 조회 하시오.**

In [6]:
select(cursor, 'A #002', table_name = 'employee_',
       column = 'ename, hiredate, deptno', cond = 'empno = 7369')

select(cursor, 'A #002 REF', table_name = 'employee_',
       column = 'empno, ename, hiredate, deptno', cond = 'empno = 7369')

[query] select ename, hiredate, deptno from employee_ where empno = 7369;

[A #002]
('SMITH', datetime.datetime(1980, 12, 17, 0, 0), 20)


[query] select empno, ename, hiredate, deptno from employee_ where empno = 7369;

[A #002 REF]
(7369, 'SMITH', datetime.datetime(1980, 12, 17, 0, 0), 20)

 #### **[Q #003]. 이름이 ALLEN인 사람의 모든 정보를 조회 하시오.**

In [7]:
select(cursor, 'A #003', table_name = 'employee_',
       cond = 'ename="ALLEN"')

[query] select * from employee_ where ename="ALLEN";

[A #003]
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)

 #### **[Q #004]. 입사일이 1983/01/12인 사람의 이름, 부서번호, 월급을 조회 하시오.**

In [8]:
select(cursor, 'A #004', table_name = 'employee_',
       column = 'ename, deptno, sal', 
       cond = 'hiredate = "19830112"')


select(cursor, 'A #004 REF', table_name = 'employee_',
       column = 'ename, deptno, sal, hiredate',
       cond   = 'hiredate = "19830112"')

[query] select ename, deptno, sal from employee_ where hiredate = "19830112";

[A #004]
('ADAMS', 20, 1100)


[query] select ename, deptno, sal, hiredate from employee_ where hiredate = "19830112";

[A #004 REF]
('ADAMS', 20, 1100, datetime.datetime(1983, 1, 12, 0, 0))

 #### **[Q #005]. 직업이 MANAGER가 아닌 사람의 모든 정보를 출력하세요.**

In [9]:
select(cursor, 'A #005', table_name = 'employee_',
       cond = 'job <> "manager"')

[query] select * from employee_ where job <> "manager";

[A #005]
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250, 1400, 30)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500, 0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300, None, 10)

 #### **[Q #006]. 이름이 K로 시작하는 사람보다 높은 이름을 가진 사람의 모든 정보를 출력하세요.**

In [10]:
select(cursor, 'A #006', table_name = 'employee_',
       cond = 'ename between "A" and "K"', order = "ename")

[query] select * from employee_ where ename between "A" and "K" order by ename;

[A #006]
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450, None, 10)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)

 #### **[Q #007]. 입사일이 1981.04.02보다 느리고 1982.12.09보다 빠른 사원의 이름, 월급, 부서번호를 조회 하시오.**

In [11]:
select(cursor,  'A #007', table_name = 'employee_',
       column = 'ename, sal, deptno', 
       cond = 'hiredate between "19810402" and "19821209"')

select(cursor,  'A #007 REF', table_name = 'employee_',
       column = 'ename, sal, deptno, hiredate', 
       cond = 'hiredate between "19810402" and "19821209"', order = 'hiredate')

[query] select ename, sal, deptno from employee_ where hiredate between "19810402" and "19821209";

[A #007]
('JONES', 2975, 20)
('MARTIN', 1250, 30)
('BLAKE', 2850, 30)
('CLARK', 2450, 10)
('SCOTT', 3000, 20)
('KING', 5000, 10)
('TURNER', 1500, 30)
('JAMES', 950, 30)
('FORD', 3000, 20)
('MILLER', 1300, 10)


[query] select ename, sal, deptno, hiredate from employee_ where hiredate between "19810402" and "19821209" order by hiredate;

[A #007 REF]
('JONES', 2975, 20, datetime.datetime(1981, 4, 2, 0, 0))
('BLAKE', 2850, 30, datetime.datetime(1981, 5, 1, 0, 0))
('CLARK', 2450, 10, datetime.datetime(1981, 6, 9, 0, 0))
('TURNER', 1500, 30, datetime.datetime(1981, 9, 8, 0, 0))
('MARTIN', 1250, 30, datetime.datetime(1981, 9, 28, 0, 0))
('KING', 5000, 10, datetime.datetime(1981, 11, 17, 0, 0))
('JAMES', 950, 30, datetime.datetime(1981, 12, 3, 0, 0))
('FORD', 3000, 20, datetime.datetime(1981, 12, 3, 0, 0))
('MILLER', 1300, 10, datetime.datetime(1982, 1, 23, 0, 0))
('SCOTT', 3000, 20, datetime.datetime(1982, 12, 9, 0, 0))

 #### **[Q #008]. 이름 중 S가 포함되어 있는 사람만의 모든 정보를 조회 하시오.**

In [12]:
select(cursor, 'A #008', table_name = 'employee_',
       cond = 'ename like "%S%"')

[query] select * from employee_ where ename like "%S%";

[A #008]
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800, None, 20)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)

#### **[Q #009]. 이름이 S로 시작하고 T로 끝나는 사람의 모든 정보를 조회 하시오.**

In [13]:
select(cursor, 'A #009', table_name = 'employee_',
       cond = 'ename like "S%T"')

[query] select * from employee_ where ename like "S%T";

[A #009]
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)

 #### **[Q #010]. 첫 번째 문자는 관계없고 두 번째 문자가 A인 사람의 정보를 조회하시오.**

In [14]:
select(cursor, 'A #010', table_name = 'employee_',
       cond = 'ename like "_A%"')

[query] select * from employee_ where ename like "_A%";

[A #010]
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250, 1400, 30)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)

 #### **[Q #011]. 급여가 많은 순으로 정렬하여 조회 하시오.**

In [15]:
select(cursor, 'A #011', table_name = 'employee_',
       order = 'sal desc')

[query] select * from employee_ order by sal desc;

[A #011]
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450, None, 10)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500, 0, 30)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300, None, 10)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250, 1400, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800, None, 20)

 #### **[Q #012]. 이름의 첫 글자가 K로 시작하거나 부서 번호가 30인 사람의 사원 번호, 이름, 부서 번호를 조회 하시오.**

In [16]:
select(cursor, 'A #012', table_name = 'employee_',
       cond   = 'ename like "K%" or deptno = 30',
       column = 'empno, ename, deptno')

[query] select empno, ename, deptno from employee_ where ename like "K%" or deptno = 30;

[A #012]
(7499, 'ALLEN', 30)
(7521, 'WARD', 30)
(7654, 'MARTIN', 30)
(7698, 'BLAKE', 30)
(7839, 'KING', 10)
(7844, 'TURNER', 30)
(7900, 'JAMES', 30)

 #### **[Q #013].급여가 1500이상이고, 부서번호가 30번인 사원 중 직업이 manager인 사람의 정보를 출력하세요.**

In [17]:
select(cursor, 'A #013', table_name = 'employee_',
       cond = 'sal >= 1500 and deptno = 30 and job = "MANAGER"')

[query] select * from employee_ where sal >= 1500 and deptno = 30 and job = "MANAGER";

[A #013]
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)

 #### **[Q #014]. 사원번호가 7654와 7782 사이 이외의 사원의 모든 정보를 조회 하시오.**

In [18]:
select(cursor, 'A #014', table_name = 'employee_',
       cond = 'not (empno between 7654 and 7782)')

[query] select * from employee_ where not (empno between 7654 and 7782);

[A #014]
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500, 0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300, None, 10)

#### **[Q #015]. 이름이 B와 J 사이의 모든 사원의 정보를 조회 하시오.**

In [19]:
select(cursor, 'A #015', table_name = 'employee_',
       cond = 'ename between "B" and "J"')

[query] select * from employee_ where ename between "B" and "J";

[A #015]
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450, None, 10)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)

#### **[Q #016]. 입사일이 81년 이외에 입사한 직원의 모든 정보를 조회 하시오.**

In [20]:
select(cursor, 'A #016', table_name = 'employee_',
       cond = 'not (hiredate like "1981%")')

[query] select * from employee_ where not (hiredate like "1981%");

[A #016]
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800, None, 20)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300, None, 10)

#### **[Q #017]. 직업이 manager와 salesman인 직원의 모든 정보를 조회 하시오.**

In [21]:
select(cursor, 'A #017', table_name = 'employee_',
       cond = 'job in ("MANAGER", "SALESMAN")')

[query] select * from employee_ where job in ("MANAGER", "SALESMAN");

[A #017]
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250, 1400, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500, 0, 30)

#### **[Q #018]. 부서번호가 20, 30번을 제외한 모든 사람의 이름, 사원번호, 부서번호 정보를 조회 하시오.**

In [22]:
select(cursor, 'A #018', table_name = 'employee_',
       cond   = 'not (deptno in (20, 30))',
       column = 'ename, empno, deptno')

[query] select ename, empno, deptno from employee_ where not (deptno in (20, 30));

[A #018]
('CLARK', 7782, 10)
('KING', 7839, 10)
('MILLER', 7934, 10)

#### **[Q #019]. 입사일이 81년도인 직원의 모든 정보를 조회 하시오.**

In [23]:
select(cursor, 'A #019', table_name = 'employee_',
       cond = 'hiredate like "1981%"')

[query] select * from employee_ where hiredate like "1981%";

[A #019]
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250, 1400, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450, None, 10)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500, 0, 30)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)

#### **[Q #020]. 커미션이 NULL인 사람의 정보를 조회 하시오.**

In [24]:
select(cursor, 'A #020', table_name = 'employee_',
       cond = 'comm is Null')

[query] select * from employee_ where comm is Null;

[A #020]
(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800, None, 20)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975, None, 20)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000, None, 10)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300, None, 10)

#### **[Q #021]. 커미션이 NULL이 아닌 사람의 정보를 조회 하시오.**

In [25]:
select(cursor, 'A #021', table_name = 'employee_',
       cond = 'not (comm is Null)')

[query] select * from employee_ where not (comm is Null);

[A #021]
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600, 300, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250, 500, 30)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250, 1400, 30)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500, 0, 30)

#### **[Q #022]. 부서 번호가 30이고, 급여가 1500 이상인 사람의 이름, 부서, 월급 정보를 조회 하시오.**

In [26]:
select(cursor, 'A #022', table_name = 'employee_',
       cond   = 'deptno = 30 and sal >= 1500',
       column = 'empno, ename, deptno') 

select(cursor, 'A #022 REF', table_name = 'employee_',
       cond   = 'deptno = 30 and sal >= 1500',
       column = 'empno, ename, deptno, sal')

[query] select empno, ename, deptno from employee_ where deptno = 30 and sal >= 1500;

[A #022]
(7499, 'ALLEN', 30)
(7698, 'BLAKE', 30)
(7844, 'TURNER', 30)


[query] select empno, ename, deptno, sal from employee_ where deptno = 30 and sal >= 1500;

[A #022 REF]
(7499, 'ALLEN', 30, 1600)
(7698, 'BLAKE', 30, 2850)
(7844, 'TURNER', 30, 1500)

#### **[Q #023]. 이름이 K로 시작하거나 부서번호가 30인 사람의 사원번호, 이름, 부서번호 정보를 조회 하시오.**

In [27]:
select(cursor, 'A #023', table_name = 'employee_',
       cond   = 'ename like "K%" or deptno = 30',
       column = 'empno, ename, deptno')

[query] select empno, ename, deptno from employee_ where ename like "K%" or deptno = 30;

[A #023]
(7499, 'ALLEN', 30)
(7521, 'WARD', 30)
(7654, 'MARTIN', 30)
(7698, 'BLAKE', 30)
(7839, 'KING', 10)
(7844, 'TURNER', 30)
(7900, 'JAMES', 30)

#### **[Q #024]. ALLEN의 직무와 같은 사람의 이름, 부서 번호, 급여, 직무 정보를 조회 하시오.**

In [28]:
select(cursor, 'A #024', table_name = 'employee_',
       cond   = 'job = (select job from employee_ where ename = "ALLEN")',
       column = 'ename, deptno, sal, job')

[query] select ename, deptno, sal, job from employee_ where job = (select job from employee_ where ename = "ALLEN");

[A #024]
('ALLEN', 30, 1600, 'SALESMAN')
('WARD', 30, 1250, 'SALESMAN')
('MARTIN', 30, 1250, 'SALESMAN')
('TURNER', 30, 1500, 'SALESMAN')

#### **[Q #025]. JONES가 속해있는 부서의 모든 사람의 사원번호, 이름, 입사일, 급여 정보를 조회 하시오.**

In [29]:
select(cursor, 'A #025', table_name = 'employee_',
       cond   = 'deptno = (select deptno from employee_ where ename = "JONES")',
       column = 'empno, ename, hiredate, sal')

select(cursor, 'A #025 REF', table_name = 'employee_',
       cond   = 'deptno = (select deptno from employee_ where ename = "JONES")',
       column = 'empno, ename, hiredate, sal, deptno')

[query] select empno, ename, hiredate, sal from employee_ where deptno = (select deptno from employee_ where ename = "JONES");

[A #025]
(7369, 'SMITH', datetime.datetime(1980, 12, 17, 0, 0), 800)
(7566, 'JONES', datetime.datetime(1981, 4, 2, 0, 0), 2975)
(7788, 'SCOTT', datetime.datetime(1982, 12, 9, 0, 0), 3000)
(7876, 'ADAMS', datetime.datetime(1983, 1, 12, 0, 0), 1100)
(7902, 'FORD', datetime.datetime(1981, 12, 3, 0, 0), 3000)


[query] select empno, ename, hiredate, sal, deptno from employee_ where deptno = (select deptno from employee_ where ename = "JONES");

[A #025 REF]
(7369, 'SMITH', datetime.datetime(1980, 12, 17, 0, 0), 800, 20)
(7566, 'JONES', datetime.datetime(1981, 4, 2, 0, 0), 2975, 20)
(7788, 'SCOTT', datetime.datetime(1982, 12, 9, 0, 0), 3000, 20)
(7876, 'ADAMS', datetime.datetime(1983, 1, 12, 0, 0), 1100, 20)
(7902, 'FORD', datetime.datetime(1981, 12, 3, 0, 0), 3000, 20)

#### **[Q #026]. MARTIN이나 SCOTT의 급여와 같은 사원의 사원번호, 이름, 급여 정보를 조회 하시오.**

In [30]:
select(cursor, 'A #026', table_name = 'employee_',
       cond   = '''sal = (select sal from employee_ where ename = "MARTIN") or \
                   sal = (select sal from employee_ where ename = "SCOTT")''',
       column = 'empno, ename, sal')

[query] select empno, ename, sal from employee_ where sal = (select sal from employee_ where ename = "MARTIN") or                    sal = (select sal from employee_ where ename = "SCOTT");

[A #026]
(7521, 'WARD', 1250)
(7654, 'MARTIN', 1250)
(7788, 'SCOTT', 3000)
(7902, 'FORD', 3000)

#### **[Q #027]. 부서 번호가 30번 부서의 최고 급여보다 높은 사원의 사원번호, 이름, 급여 정보를 조회 하시오.**

In [31]:
select(cursor, 'A #027', table_name = 'employee_',
       cond   = 'sal > (select max(sal) from employee_ where deptno = 30)',
       column = 'empno, ename, sal')

select(cursor, 'A #027 REF', table_name = 'employee_',
       column = 'max(sal)',
       cond   = 'deptno = 30')

[query] select empno, ename, sal from employee_ where sal > (select max(sal) from employee_ where deptno = 30);

[A #027]
(7566, 'JONES', 2975)
(7788, 'SCOTT', 3000)
(7839, 'KING', 5000)
(7902, 'FORD', 3000)


[query] select max(sal) from employee_ where deptno = 30;

[A #027 REF]
(2850,)

#### **[Q #028]. 사원 중 급여와 보너스를 합친 금액이 가장 많은 경우와 가장 적은 경우, 평균 금액을 조회 하시오.**

In [32]:
select(cursor, 'A #028', table_name = 'employee_',
       column = 'max(sal + comm), min(sal + comm), avg(sal + comm)')

select(cursor, 'A #028 REF', table_name = 'employee_',
       column = 'sal + comm')

[query] select max(sal + comm), min(sal + comm), avg(sal + comm) from employee_;

[A #028]
(2650, 1500, Decimal('1950.0000'))


[query] select sal + comm from employee_;

[A #028 REF]
(None,)
(1900,)
(1750,)
(None,)
(2650,)
(None,)
(None,)
(None,)
(None,)
(1500,)
(None,)
(None,)
(None,)
(None,)

#### **[Q #029]. 급여가 30번 부서의 최고 급여보다 높은 사원의 사원 번호, 이름, 급여 정보를 조회 하시오.**

In [33]:
select(cursor, 'A #029', table_name = 'employee_',
       column = 'empno, ename, sal',
       cond   = 'sal > (select max(sal) from employee_ where deptno = 30)')

select(cursor, 'A #029 REF', table_name = 'employee_',
       column = 'max(sal)', cond = 'deptno = 30')

[query] select empno, ename, sal from employee_ where sal > (select max(sal) from employee_ where deptno = 30);

[A #029]
(7566, 'JONES', 2975)
(7788, 'SCOTT', 3000)
(7839, 'KING', 5000)
(7902, 'FORD', 3000)


[query] select max(sal) from employee_ where deptno = 30;

[A #029 REF]
(2850,)

In [34]:
conn.close()

# **99. 참고자료**
## **99-1. 도서**  
## **99-2. 논문, 학술지**

## **99-3. 웹 사이트**
- 작업실 | [SQL/실습] 데이터 검색 - 연습문제 풀어보기 2 (문제) [[블로그 링크]](https://reeme.tistory.com/35?category=905298)

## **99-4. 데이터셋 출처**